from redis import  Redis

host = "localhost"
port = 6379

server = Redis(
    host="localhost",
    port=6379,
    db=0,
    decode_responses=True,
)

# user_name = server.get("NAME")
# print(user_name)



# Практичне завдання
# Модуль 16
# Використання баз даних
# (частина 3)
# Взаємодія з Redis через консоль
# Завдання 1 Запуск сервера Redis
# Встановіть Redis на свій комп'ютер.
# Запустіть сервер Redis через консоль.
# Завдання 2 Додавання ключа-значення
#  Використовуючи команду SET, додайте ключ "name" і
# значення "John Doe".

# SET NAME JOHN
# user_name = server.set("name", "john")
# print(user_name)

# Завдання 3 Отримання значення за ключем
#  За допомогою команди GET, отримайте значення ключа
# "name".

# name = server.get("name")
# print(name)

# Завдання 4 Додавання списку
#  Використовуючи команду RPUSH, додайте до списку
# "fruits" елементи "apple", "banana", "orange".

# server.rpush("fruits", "apple", "banana", "orange")

# Завдання 5 Отримання елементів списку
#  За допомогою команди LRANGE, отримайте всі елементи
# зі списку "fruits".

# fruits = server.lrange("fruits", 0, -1)
# print(fruits)
# 1
# Практичне завдання
# Завдання 6 Додавання хешу
# Використовуючи команду HMSET, додайте до хешу
# "user:1" поля "name" зі значенням "Alice" і "age" зі
# значенням 25.
# data = {
#     "name":"Alice",
#     "age":25,
# }
# server.hmset("user:1",data)

# Завдання 7 Отримання значень з хешу
# За допомогою команди HGETALL, отримайте всі поля
# та значення з хешу "user:1".
# name = server.hgetall("user:1")
# print(name)

# Завдання 8 Додавання елементу до множини
# Використовуючи команду SADD, додайте до множини
# "tags" елементи "red", "green", "blue".
#
# server.sadd("tags","red","green","blue","жовтий")

# Завдання 9 Отримання всіх елементів множини
# За допомогою команди SMEMBERS, отримайте всі
# елементи з множини "tags".

# name = server.smembers("tags")
# print(name)

# Завдання 10 Додавання лічильника
# Використовуючи команду INCR, додайте до лічильника
# "counter" одиницю.


# server.incr("counter",10)
# server.incr("counter",20)
# # Завдання 11 Отримання значення лічильника
# # За допомогою команди GET, отримайте значення
# # лічильника "counter".
#
# total = server.get("counter")
# print(total)
# 2
# Практичне завдання
# Завдання 12 Видалення ключа
# Використовуючи команду DEL, видаліть ключ "name".

# server.delete("name")

# Завдання 13 Перевірка існування ключа
# За допомогою команди EXISTS, перевірте існування
# ключа "name".

# is_exist = server.exists("name")
# is_exist = bool(is_exist)
# print(is_exist)

# Завдання 14 Додавання значення з таймаутом
# Використовуючи команду SETEX, додайте ключ "message"
# зі значенням "Hello, Redis!" і таймаутом 60 секунд.


# server.setex("message",5,"hello, Redis!")
# text = server.get("message")
# print(text)

# Завдання 15 Очищення всіх ключів
#  Використовуючи команду FLUSHALL, очистіть всі ключі
# та дані в Redis.

# server.flushall()

# Завдання 16 Геоаналітика з Redis
# Створіть ключ "geo_locations" та додайте до нього геодані
# (координати) різних місць в вашому місті. Використовуйте
# команду GEOADD для додавання геоданих.
# Завдання 17 Хешування
#  Створіть у Redis ключ "students" і додайте до нього
# інформацію про студентів у вигляді хешу, де ключ - ім'я
# студента, а значення - його середній бал. Виведіть інформацію
# про всіх студентів, змініть середній бал одного із студентів та
# виведіть оновлену інформацію.
# 3
# Практичне завдання
# Завдання 18 Статистика унікальних користувачів
# Створіть гіперлоглог "unique_users" та додайте до нього
# ідентифікатори унікальних користувачів за допомогою
# команди PFADD.
# Завдання 19 Використання транзакцій
#  Використовуючи команду MULTI, розпочніть транзакцію.
# Додайте декілька команд до транзакції, наприклад,
# додавання до списку та хешу.
#  Використовуючи команду EXEC, виконайте транзакцію.
# Завдання 20 Закриття сервера Redis
# Закрийте сервер Redis через консоль.
# Ці завдання можуть допомогти вам ознайомитися з
# базовими командами Redis і здобути практичні навички
# взаємодії з цією базою даних.
# Результат роботи: скріншоти консолі
# 4