-- Завдання 1
-- Створіть наступні запити для бази даних з інформацією
-- про овочі та фрукти з попереднього домашнього завдання:
-- ■ Відображення усіх овочів з калорійністю, менше 50.


-- SELECT *
-- FROM products
-- WHERE CALORIE < 50


-- ■ Відображення усіх фруктів з калорійністю у вказаному
-- діапазоні.

-- SELECT *
-- FROM products
-- WHERE CALORIE BETWEEN 40 AND 60



-- ■ Відображення усіх овочів, у назві яких є вказане слово.
-- Наприклад, слово: капуста.

-- SELECT *
-- FROM products
-- WHERE NAME = 'Манго'


-- ■ Відображення усіх овочів та фруктів, у короткому описі
-- яких є вказане слово. Наприклад, слово: гемоглобін.

-- SELECT *
-- FROM products
-- WHERE DESCRIPTION ILIKE '%овоч%'
--    OR DESCRIPTION ILIKE 'овоч%'
--    OR DESCRIPTION ILIKE '%овоч'

-- Показати усі овочі та фрукти жовтого або червоного
-- кольору.

-- SELECT *
-- FROM products
-- WHERE COLOR  = 'жовтий' OR COLOR = 'червоний'


-- Створіть наступні запити для бази даних з інформацією
-- про овочі та фрукти з попереднього домашнього завдання:
-- ■ Показати кількість овочів.

-- SELECT COUNT(*) AS кількість_овочів
-- FROM products
-- WHERE type = 'овоч'


-- ■ Показати кількість фруктів.


-- SELECT COUNT(*) AS кількість_фруктів
-- FROM products
-- WHERE type = 'фрукт'

-- ■ Показати кількість овочів та фруктів заданого кольору.
-- SELECT COUNT(*) AS кількість_фруктів_овочів
-- FROM products
-- WHERE COLOR = 'червоний'

-- ■ Показати кількість овочів та фруктів кожного кольору.
-- SELECT color, type, COUNT(*) AS кількість
-- FROM products
-- GROUP BY color, type


-- ■ Показати мінімальну калорійність овочів та фруктів.

-- SELECT MIN(CALORIE) AS мін_колорії
-- FROM PRODUCTS

-- ■ Показати максимальну калорійність овочів та фруктів.

-- SELECT MAX(CALORIE) AS макс_колорії
-- FROM PRODUCTS
-- ■ Показати середню калорійність овочів та фруктів.

-- SELECT AVG(CALORIE) AS  середня_калорійність
-- FROM PRODUCTS


-- ■ Показати фрукт з мінімальною калорійністю.
-- SELECT MIN(CALORIE) AS мін_колорії
-- FROM PRODUCTS
-- WHERE TYPE = 'фрукт'


-- ■ Показати фрукт з максимальною калорійністю
-- SELECT Max(CALORIE) AS макс_колорії
-- FROM PRODUCTS
-- WHERE TYPE = 'фрукт'


